# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [94]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [95]:
# define the data's path
path = "../../19_lab_subsetting_and_descriptive_stats/your-code/Orders.csv"

In [96]:
# enter your code here
orders = pd.read_csv(path)

In [97]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [98]:
# Step 1: Aggregate the values by 'CustomerID' and return the sum
customers_df = orders.groupby('CustomerID').sum()

In [99]:
customers_df.head(1)

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12346,61619,541431,2011,1,2,10,74215,1.04,77183.6

In [100]:
# select the columns 'amout_spend' and reset_index()
customers_df = customers_df['amount_spent'].reset_index()

In [101]:
customers_df.head(1)

   CustomerID  amount_spent
0       12346       77183.6

In [102]:
# Step 2: amount_spent of to quantiles 75% and 95%
Q95 = customers_df['amount_spent'].quantile(0.95)
Q75 = customers_df['amount_spent'].quantile(0.75)

In [103]:
print(Q95)
print(Q75)

5840.181999999983
1661.6400000000003

In [104]:
# Step 3: create a funtion to label the customers according to their amount_spent values  
def customer_group(row):
    if row['amount_spent'] >= Q95:
        return('VIP')
    elif row['amount_spent'] >= Q75 and row['amount_spent'] < Q95:
        return('Preferred')
    return('Regular')

In [105]:
# Step 4: Apply the function to the dataframe
customers_df['Group'] = customers_df.apply(
    lambda row: customer_group(row), axis=1)

In [106]:
# Select the 'CustomerID' and the 'Group' variables
customers_group = customers_df[['CustomerID','Group']]

In [107]:
customers_group.head()

   CustomerID      Group
0       12346        VIP
1       12347  Preferred
2       12348  Preferred
3       12349  Preferred
4       12350    Regular

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

In [91]:
# SUB PROBLEM 1: Merge orders and customers_group_df 

orders_customer = pd.merge(
    # import left df
    orders, 
    # import right df
    customers_group, 
    # column's match
    on='CustomerID',
    # use keys from left frame only
    how='left')

In [92]:
orders_customer.head(1)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,Group
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.3,Preferred

In [125]:
# Select the columns
columns = ['CustomerID','Country','Group']

* Note that we can transform a groupby object into a dictionary whose keys represent unique groups and corresponding values being the axis labels of each group

In [156]:
# group the data by 'CustomerID','Country', and'Group'
orders_cust_group = orders_customer.groupby(columns).groups.keys()

In [131]:
# convert the dict_key element into a list
list_orders_cust_group = list(orders_cust_group)

In [157]:
# convert the list into a dataframe
country_cust = pd.DataFrame(list_orders_cust_group,
            columns=columns)

In [158]:
country_cust.head(1)

   CustomerID         Country Group
0       12346  United Kingdom   VIP

In [159]:
country_cust.pivot_table(
    values='CustomerID',
    index='Country',
    columns='Group',
    aggfunc='count'

).head()

Group      Preferred  Regular  VIP
Country
Australia        2.0      5.0  2.0
Austria          3.0      8.0  NaN
Bahrain          NaN      2.0  NaN
Belgium         11.0     13.0  1.0
Brazil           NaN      1.0  NaN

In [160]:
# For all customers, find those who are VIP.
country_vips = country_cust[
    country_cust['Group'] == 'VIP']

In [161]:
country_vips.head()

    CustomerID         Country Group
0        12346  United Kingdom   VIP
10       12357     Switzerland   VIP
12       12359          Cyprus   VIP
52       12409     Switzerland   VIP
57       12415       Australia   VIP

In [162]:
# Count the number of customers that made orders from each country
country_count = country_vips[[
    'Country', 'CustomerID']].groupby('Country').count()

In [163]:
country_count.head()

                 CustomerID
Country
Australia                 2
Belgium                   1
Channel Islands           1
Cyprus                    1
Denmark                   1

In [164]:
# countries with the largest number of VIP customers
country_count.nlargest(1,'CustomerID')

                CustomerID
Country
United Kingdom         177


# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [165]:
# customers who are VIP or Preferre
country_vip_pref = country_cust[
    country_cust['Group'].isin(['VIP','Preferred'])]

In [166]:
country_vip_pref.head()

   CustomerID         Country      Group
0       12346  United Kingdom        VIP
1       12347         Iceland  Preferred
2       12348         Finland  Preferred
3       12349           Italy  Preferred
5       12352          Norway  Preferred

In [167]:
# number of customers by country
country_cust = country_vip_pref[[
    'Country', 'CustomerID']].groupby('Country').count()

In [168]:
country_cust.head()

                 CustomerID
Country
Australia                 4
Austria                   3
Belgium                  12
Canada                    1
Channel Islands           4

In [169]:
# countries with the largest number of VIP and Preferred customers
country_cust.nlargest(1,'CustomerID')

                CustomerID
Country
United Kingdom         932